#lang racket
; Нарисуйте дерево, иллюстрирующее процесс, который порождается процедурой count-change из
; раздела 1.2.2 при размене 11 центов. Каковы порядки роста памяти и числа шагов,
; используемых этим процессом при увеличении суммы, которую требуется разменять?
; 
;
;
                                            ;                       (count-change 11)
                                            ;                             ||
                                            ;                         (cc 11 5)
                                            ;                             ||            
                                            ;                   (+ (cc 11 4) (cc (- 11 50) 5))
                                            ;                          ||           ||
                                            ;       (+ (cc 11 3) (cc (- 11 25) 4))  0
                                            ;               ||          ||
                    ;                  (+ (cc 11 2) (cc (- 11 10) 3)    0
                    ;                     ||                ||  
                        ;                 ||            (+ (cc 1 2) (cc (- 1 10) 3))                                        
                            ;             ||                    ||          0                                                       
                            ;             ||                (+ (cc 1 1) (cc (- 1 5) 2))
                            ;             ||                        ||          0
                            ;             ||                (+ (cc 1 0) (cc 0 1))                   
                            ;             ||                    ||          ||
                            ;             ||                    0           1
                        ;                 ||
            ;                             ||
        ;                     (+ (cc 11 1) (cc (- 10 5) 2))
        ;                          ||              ||
        ;            (+ (cc 11 0) (cc 10 1)    (+ (cc 5 1) (cc (- 5 5) 2))
        ;                ||       ||                ||              ||
        ;                0 (+ (cc 10 0) (cc 9 1))   ||              1
        ;                       0         ||        ||
        ;                  (+ (cc 9 0) (cc 8 1))   (+ (cc 5 0) (cc (- 5 1) 1))  
        ;                                ||          ||           ||
        ;                (+ (cc 8 0) (cc 7 1)        0       (+ (cc 4 0) (cc 3 1))    
        ;                     ||          ||                      ||        ||
        ;                      0   (+ (cc 7 0) (cc 6 1))         0      (+ (cc 3 0) (cc 2 1))
        ;                                0       ||                        ||        ||
        ;                               (+ (cc 6 0) (cc 5 1))               0      (+ (cc 2 0) (cc 1 1)) 
        ;                                    ||       ||                             ||         ||
        ;                                     0 (+ (cc 5 0) (cc 4 1))                 0       (+ (cc 1 0) (cc 0 1))
        ;                                            0         ||                                 ||          ||  
        ;                                            (+ (cc 4 0) (cc 3 1))                        0            1
        ;                                                 ||          ||
        ;                                                  0      (+ (cc 3 0) (cc 2 1))
        ;                                                              ||            ||
        ;                                                              0          (+ (cc 2 0) (cc 1 1))       
        ;                                                                              ||          ||
        ;                                                                              0       (+ (cc 0 1)) (cc 0 1))
        ;                                                                                             ||        ||
        ;                                                                                              0        1

; Количество вызовов функции cc пропорционально сумме размена, а значит порядок роста памяти - O(n).
